src/main/resources/xmls/salesforcequery/CreateTalentExperience.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
   <Header>
      <SessionHeader xmlns="urn:partner.soap.sforce.com">
         <sessionId></sessionId>
      </SessionHeader>
   </Header>
   <Body>
      <create xmlns="urn:partner.soap.sforce.com">
         <sObjects>
            <type xmlns="urn:sobject.partner.soap.sforce.com">Talent_Experience__c</type>
            <Talent__c xmlns=""></Talent__c>
            <Client__c xmlns=""></Client__c>
            <Currency__c xmlns=""></Currency__c>
            <Current_Assignment__c xmlns=""></Current_Assignment__c>
            <Department__c xmlns=""></Department__c>
            <Start_Date__c xmlns=""></Start_Date__c>
            <End_Date__c xmlns=""></End_Date__c>
            <Organization_Name__c xmlns=""></Organization_Name__c>
            <Rate_Frequency__c xmlns=""></Rate_Frequency__c>
            <Salary__c xmlns=""></Salary__c>
            <Title__c xmlns=""></Title__c>
            <Type__c xmlns=""></Type__c>
            <Allegis_Placement__c xmlns=""></Allegis_Placement__c>
          </sObjects>
      </create>
   </Body>
</Envelope>